#include "MSI.h"

/*-------------------------------------------------------------
            Создание объекта - открытие файла mp3
--------------------------------------------------------------*/

MSI::MSI(std::wstring name) : file_name{name}
{
    std::wstring msg = L"open " + file_name + L" type mpegvideo alias" + file_name;
    mciSendString(msg.c_str(), NULL, 0, NULL);
}

/*-------------------------------------------------------------
             Закрытие файла - освобождение ресурса
--------------------------------------------------------------*/

MSI::~MSI() {
    std::wstring msg = L"close " + file_name;
    mciSendString(msg.c_str(), NULL, 0, NULL);
}

/*-------------------------------------------------------------
                 Однократно проиграть музыку
--------------------------------------------------------------*/
void MSI::play() {
    if (!flag_mute) {
        std::wstring msg = L"play " + file_name;
        mciSendString(msg.c_str(), NULL, 0, NULL);
    }
}

/*-------------------------------------------------------------
                 Циклично проигрывать музыку
--------------------------------------------------------------*/
void MSI::play_repeat() {
    if (!flag_mute) {
        std::wstring msg = L"play " + file_name + L" repeat";
        mciSendString(msg.c_str(), NULL, 0, NULL);
    }
}

/*-------------------------------------------------------------
                        Установить паузу
--------------------------------------------------------------*/
void MSI::pause() {
    if (!flag_mute) {
        std::wstring msg = L"pause " + file_name;
        mciSendString(msg.c_str(), NULL, 0, 0);
    }
}

/*-------------------------------------------------------------
                         Снять с паузы
--------------------------------------------------------------*/
void MSI::resume() {
    if (!flag_mute) {
        std::wstring msg = L"resume " + file_name;
        mciSendString(msg.c_str(), NULL, 0, 0);
    }
}

/*-------------------------------------------------------------
                       Остановить музыку
--------------------------------------------------------------*/
void MSI::stop() {
    if (!flag_mute) {
        std::wstring msg = L"stop " + file_name;
        mciSendString(msg.c_str(), NULL, 0, 0);
    }
}

/*-------------------------------------------------------------
                  Перестать проигрывать звуки
--------------------------------------------------------------*/
void MSI::mute() {
    flag_mute = !flag_mute;
}

bool MSI::flag_mute{ false };