#pragma once
#include <Windows.h>
#include <string>
#include <exception>
#include "Window_Create.h"
#include "Objects.h"



class Tetris {

public:
	Tetris(); 
	~Tetris() = default;

/*-------------------------------------------------------------
						  Методы окна
--------------------------------------------------------------*/
	//статическая функция CALLBACK - передает вызов объектной функции CALLBACK
	static LRESULT CALLBACK window_proc(HWND hwnd, UINT uMsg, WPARAM wParam, LPARAM lParam);

/*-------------------------------------------------------------
					   Методы приложения
--------------------------------------------------------------*/
public:
	LRESULT CALLBACK application_proc(); //объектная функция CALLBACK
	int run(); //запуск оконного приложения - отлавливаю исключения
	int play(); //вечный цикл - запуск игры


/*-------------------------------------------------------------
				  Методы обработки сообщений
--------------------------------------------------------------*/
	int wm_paint(); //перерисовка окна
	int wm_keydown(); //обработка нажатий клавиш
	int wm_timer(); //обработка событий таймера
	int wm_command(); //обработка команд - нажатие кнопки

/*-------------------------------------------------------------
							Данные
--------------------------------------------------------------*/
private:

	HWND m_hwnd{}; //дескриптор главного окна приложения
	UINT m_uMsg{}; //сообщение из оконной процедуры
	WPARAM m_wParam{}; //wParam из оконной процедуры
	LPARAM m_lParam{}; //lParam из оконной процедуры

/*-------------------------------------------------------------
						 Настройки окна
--------------------------------------------------------------*/
	WSTR name_class_window{ L"My_Window" }; //задаю имя класса окна
	WSTR name_header_window{ L"Тетрис" }; //задаю заголовок окна
	int width_window{}; //ширина окна
	int height_window{}; //высота окна
	Size_Window sz; //размеры окна

/*-------------------------------------------------------------
						  Объекты игры
--------------------------------------------------------------*/
	Objects obj{ m_hwnd, m_uMsg, m_wParam,  m_lParam }; //объект приложения игры
	const int ID_TIMER{ 1 }; //ID таймера - номер таймера
};
